'''
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X
пример
5
1 2 3 4 5
3
-> 1
'''

n = int(input("Введите количество элементов: "))
new_list = []
for i in range(n):
    new_list.append(i + 1)
x = int(input("Введите число которое необходимо найти: "))
i = 0
for index in range(len(new_list)):
    if new_list[index] == x:
        i += 1
print(f'Число {x} встретилось {i} раз')

'''
Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих строках записаны N целых чисел Ai. 
Последняя строка содержит число X
пример
5
1 2 3 4 5
6
-> 5
'''

n = int(input("Введите количество элементов: "))
new_list = []
for i in range(n):
    new_list.append(i + 1)
x = int(input("Введите число которое необходимо найти: "))
i = new_list[0]
for index in range(len(new_list) - 1):
    if new_list[index] == x:
        i == new_list[index]
    elif new_list[index - 1] == x:
        i = new_list[index - 1]
    elif new_list[index + 1] <= x:
        i = new_list[index + 1]
print(f'Ближайшее число - {i}')

'''
Задача 20: В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. В случае с английским алфавитом очки распределяются так:
A, E, I, O, U, L, N, S, T, R – 1 очко;
D, G – 2 очка;
B, C, M, P – 3 очка;
F, H, V, W, Y – 4 очка;
K – 5 очков;
J, X – 8 очков;
Q, Z – 10 очков.
А русские буквы оцениваются так:
А, В, Е, И, Н, О, Р, С, Т – 1 очко;
Д, К, Л, М, П, У – 2 очка;
Б, Г, Ё, Ь, Я – 3 очка;
Й, Ы – 4 очка;
Ж, З, Х, Ц, Ч – 5 очков;
Ш, Э, Ю – 8 очков;
Ф, Щ, Ъ – 10 очков.
Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что на вход подается только одно слово, 
которое содержит либо только английские, либо только русские буквы.
пример
Ввод:
ноутбук
Вывод:
12
'''

dict_eng = {1: 'A, E, I, O, U, L, N, S, T, R', 2: 'D, G',
            3: 'B, C, M, P', 4: 'F, H, V, W, Y', 5: 'K', 8: 'J, X', 10: 'Q, Z'}
dict_rus = {1: 'А, В, Е, И, Н, О, Р, С, Т', 2: 'Д, К, Л, М, П, У',
            3: 'Б, Г, Ё, Ь, Я', 4: 'Й, Ы', 5: 'Ж, З, Х, Ц, Ч', 8: 'Ш, Э, Ю', 10: 'Ф, Щ, Ъ'}

str = input("Введите слово: ")


def result(str, dictionary):
    str = str.upper()
    result = 0
    for i in str:
        k = ""
        for j, v in dictionary.items():
            k = dictionary[j].split(', ')
            for d in k:
                if i == d:
                    result += j
    return result


if result(str, dict_rus) == 0:
    print(result(str, dict_eng))
else:
    print(result(str, dict_rus))
