'''
Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.
A = 3; B = 5 -> 243 (3⁵)
A = 2; B = 3 -> 8
'''


def multi(a, b):
    if b == 0:
        return 1
    b -= 1
    return a * multi(a, b)


print(multi(3, 5))

'''
Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
2 2
4
'''


def sum(a, b):
    if a + b == 0:
        return 0
    elif a > 0:
        a -= 1
    elif b > 0:
        b -= 1
    return 1 + sum(a, b)


print(sum(2, 2))
